Revit 2024 API
Camera.NearDistance Property
 Distance to near clipping plane
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double NearDistance { get; set; }
Visual Basic
Public Property NearDistance As Double
	Get
	Set
Visual C++
public:
property double NearDistance {
	double get ();
	void set (double value);
}
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace